10/data/attachments/457a23501aebd7c2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Nathan_appear_Friend_6473_3</nif:username>
            <nif:friendToBeRequested>soap_friends_2c1b31c5-c3fd-411f-bd6d-e929b1593c3f</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>